{
  "earlyLife": "Born on November 5, 1988, in Delhi, India, Virat Kohli showed immense promise from a young age. His father, Prem Kohli, recognized his talent and enrolled him in the West Delhi Cricket Academy at the age of nine. Kohli's early years were marked by dedication and a relentless drive to excel, often training for hours on end.",
  "juniorCricket": "Kohli's talent shone brightly in junior cricket. He captained the victorious Indian team at the 2008 ICC Under-19 Cricket World Cup in Malaysia, a pivotal moment that propelled him into the national spotlight and hinted at his future leadership qualities.",
  "internationalDebut": "His consistent performances led to his ODI debut for India in August 2008 against Sri Lanka. While his Test debut came later in 2011, he quickly established himself across all formats, showcasing a unique blend of aggression and classical batting technique.",
  "captaincyEra": "Kohli took over Test captaincy in 2014 and later became the full-time captain in all formats in 2017. Under his leadership, India achieved unprecedented success, including a historic Test series win in Australia and reaching the top of the ICC Test rankings for an extended period. His captaincy was marked by an aggressive, fitness-first approach and a desire to win every match.",
  "postCaptaincy": "After stepping down from captaincy in T20Is (2021), ODIs (2021), and Tests (2022), Kohli continues to be a vital part of the Indian team. He remains one of the world's leading batsmen, constantly breaking records and demonstrating his unwavering commitment to the game.",
  "personalLife": "Beyond the cricket field, Virat Kohli is married to Bollywood actress Anushka Sharma. They have a daughter, Vamika. Kohli is also known for his philanthropic efforts, particularly through the 'Virat Kohli Foundation,' which focuses on supporting underprivileged children.",
  "playingStyle": "Known for his aggressive yet elegant batting, exceptional fitness, and fierce competitive spirit. He is renowned for his strong wrists, ability to play shots all around the wicket, and his masterful run-chasing in limited-overs cricket."
}